In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math
import random as rnd
fortune  = pd.read_csv(r'E:\PythonAnacondaScripts\course-files\Fortune_500_2017.csv', usecols=['Rank','Title','Employees','Profits','Assets'],
                   low_memory=False, index_col='Rank')

In [20]:
fortune['Employees'].rank(ascending = False)

Rank
1        1.0
2        7.0
3       57.0
4       94.0
5      104.5
       ...
496    218.0
497    475.0
498    420.5
499    474.0
500     60.5
Name: Employees, Length: 500, dtype: float64

In [40]:
fortune.sort_values(['Employees'], ascending=False)

                       Title  Employees  Profits  Assets  RankByEmployee
Rank
1                    Walmart    2300000  13643.0  198825             1.0
18                    Kroger     443000   1975.0   36505             2.0
399       Yum China Holdings     420000    502.0    3727             3.0
32                       IBM     414400  11872.0  117470             4.0
23                Home Depot     406000   7957.0   42966             5.0
...                      ...        ...      ...     ...             ...
334          Global Partners       1770   -199.4    2564           496.0
189             INTL FCStone       1464     54.7    5951           497.0
480        Delek US Holdings       1326   -153.7    2985           498.0
472    Host Hotels & Resorts        220    762.0   11408           499.0
395   A-Mark Precious Metals         83      9.3     437           500.0

[500 rows x 5 columns]

In [31]:
fortune[['Title', 'Employees']]

                   Title  Employees
Rank
1                Walmart    2300000
2     Berkshire Hathaway     367700
3                  Apple     116000
4            Exxon Mobil      72700
5               McKesson      68000
...                  ...        ...
496        Michaels Cos.      31000
497        Toll Brothers       4200
498                Yahoo       8500
499        Vistra Energy       4431
500       ABM Industries     110000

[500 rows x 2 columns]

In [38]:
fortune['RankByEmployee'] = fortune['Employees'].rank(ascending = False)

In [44]:
fortune['RankByProfits'] = fortune['Profits'].rank()

In [48]:
fortune.sort_values(['RankByProfits'], ascending = False).head(15)

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
3,Apple,116000,45687.0,321686,57.0,500.0
21,J.P. Morgan Chase,243355,24733.0,2490972,20.0,499.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,498.0
25,Wells Fargo,269100,21938.0,1930115,15.0,497.0
27,Alphabet,72053,19478.0,167497,96.0,496.0
26,Bank of America Corp.,208024,17906.0,2187702,29.0,495.0
28,Microsoft,114000,16798.0,193694,58.5,494.0
35,Johnson & Johnson,126400,16540.0,141208,51.0,493.0
30,Citigroup,219000,14912.0,1792077,26.0,492.0
148,Altria Group,8300,14239.0,45932,424.0,491.0
1,Walmart,2300000,13643.0,198825,1.0,490.0
92,Gilead Sciences,9000,13501.0,56977,409.0,489.0
14,Verizon,160900,13127.0,244180,38.0,488.0
9,AT&T,268540,12976.0,403821,16.0,487.0
20,Fannie Mae,7000,12313.0,3287968,446.5,486.0

In [52]:
fortune.nlargest(n=3, columns='Assets')

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
20,Fannie Mae,7000,12313.0,3287968,446.5,486.0
21,J.P. Morgan Chase,243355,24733.0,2490972,20.0,499.0
26,Bank of America Corp.,208024,17906.0,2187702,29.0,495.0